{"format": "graph-model", "generatedBy": "2.7.0", "convertedBy": "TensorFlow.js Converter v2.8.0", "signature": {"inputs": {"input_tensor:0": {"name": "input_tensor:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "-1"}, {"size": "-1"}, {"size": "3"}]}}}, "outputs": {"Identity:0": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "2048"}]}}}}, "modelTopology": {"node": [{"name": "StatefulPartitionedCall/strided_slice/stack", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "1"}, {"size": "3"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "input_tensor", "op": "Placeholder", "attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {"dim": [{"size": "1"}, {"size": "-1"}, {"size": "-1"}, {"size": "3"}]}}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/StatefulPartitionedCall/vggface_senet50/conv1/7x7_s2/Conv2D_weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "7"}, {"size": "7"}, {"size": "3"}, {"size": "64"}]}}}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/StatefulPartitionedCall/vggface_senet50/conv1/7x7_s2/Conv2D_bn_offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/StatefulPartitionedCall/vggface_senet50/conv2_1_1x1_reduce/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "64"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/StatefulPartitionedCall/vggface_senet50/conv2_1_1x1_reduce/Conv2D_bn_offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/StatefulPartitionedCall/vggface_senet50/conv2_1_1x1_proj/Conv2D_weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "64"}, {"size": "256"}]}}}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/StatefulPartitionedCall/vggface_senet50/conv2_1_1x1_proj/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/StatefulPartitionedCall/vggface_senet50/conv2_1_3x3/Conv2D_weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "64"}]}}}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/StatefulPartitionedCall/vggface_senet50/conv2_1_3x3/Conv2D_bn_offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/StatefulPartitionedCall/vggface_senet50/conv2_1_1x1_increase/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "64"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/StatefulPartitionedCall/vggface_senet50/conv2_1_1x1_increase/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/StatefulPartitionedCall/vggface_senet50/conv2_2_1x1_reduce/Conv2D_weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "256"}, {"size": "64"}]}}}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/StatefulPartitionedCall/vggface_senet50/conv2_2_1x1_reduce/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/StatefulPartitionedCall/vggface_senet50/conv2_2_3x3/Conv2D_weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "64"}]}}}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/StatefulPartitionedCall/vggface_senet50/conv2_2_3x3/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/StatefulPartitionedCall/vggface_senet50/conv2_2_1x1_increase/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "64"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/StatefulPartitionedCall/vggface_senet50/conv4_6_1x1_reduce/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "1024"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/StatefulPartitionedCall/vggface_senet50/conv2_2_1x1_increase/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/StatefulPartitionedCall/vggface_senet50/conv4_6_1x1_reduce/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/StatefulPartitionedCall/vggface_senet50/conv2_3_1x1_reduce/Conv2D_weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "256"}, {"size": "64"}]}}}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/StatefulPartitionedCall/vggface_senet50/conv2_3_1x1_reduce/Conv2D_bn_offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/StatefulPartitionedCall/vggface_senet50/conv4_6_3x3/Conv2D_weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "256"}, {"size": "256"}]}}}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/StatefulPartitionedCall/vggface_senet50/conv2_3_3x3/Conv2D_weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "64"}]}}}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/StatefulPartitionedCall/vggface_senet50/conv5_3_1x1_reduce/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "2048"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/StatefulPartitionedCall/vggface_senet50/conv2_3_3x3/Conv2D_bn_offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/StatefulPartitionedCall/vggface_senet50/conv4_6_3x3/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/StatefulPartitionedCall/vggface_senet50/conv2_3_1x1_increase/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "64"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/StatefulPartitionedCall/vggface_senet50/conv2_3_1x1_increase/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/StatefulPartitionedCall/vggface_senet50/conv4_6_1x1_increase/Conv2D_weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "256"}, {"size": "1024"}]}}}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/StatefulPartitionedCall/vggface_senet50/conv5_3_1x1_reduce/Conv2D_bn_offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/StatefulPartitionedCall/vggface_senet50/conv3_1_1x1_reduce/Conv2D_weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "256"}, {"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/StatefulPartitionedCall/vggface_senet50/conv4_6_1x1_increase/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1024"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/StatefulPartitionedCall/vggface_senet50/conv3_1_1x1_reduce/Conv2D_bn_offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/StatefulPartitionedCall/vggface_senet50/conv3_1_1x1_proj/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "256"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/StatefulPartitionedCall/vggface_senet50/conv3_1_1x1_proj/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/StatefulPartitionedCall/vggface_senet50/conv3_1_3x3/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/StatefulPartitionedCall/vggface_senet50/conv3_1_3x3/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/StatefulPartitionedCall/vggface_senet50/conv3_1_1x1_increase/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "128"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/StatefulPartitionedCall/vggface_senet50/conv3_1_1x1_increase/Conv2D_bn_offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/StatefulPartitionedCall/vggface_senet50/conv3_2_1x1_reduce/Conv2D_weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "512"}, {"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/StatefulPartitionedCall/vggface_senet50/conv3_2_1x1_reduce/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/StatefulPartitionedCall/vggface_senet50/conv5_3_3x3/Conv2D_weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "512"}, {"size": "512"}]}}}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/StatefulPartitionedCall/vggface_senet50/conv3_2_3x3/Conv2D_weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/StatefulPartitionedCall/vggface_senet50/conv3_2_3x3/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/StatefulPartitionedCall/vggface_senet50/conv3_2_1x1_increase/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "128"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/StatefulPartitionedCall/vggface_senet50/conv3_2_1x1_increase/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/StatefulPartitionedCall/vggface_senet50/conv5_1_1x1_reduce/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "1024"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/StatefulPartitionedCall/vggface_senet50/conv3_3_1x1_reduce/Conv2D_weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "512"}, {"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/StatefulPartitionedCall/vggface_senet50/conv3_3_1x1_reduce/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/StatefulPartitionedCall/vggface_senet50/conv5_1_1x1_reduce/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/StatefulPartitionedCall/vggface_senet50/conv3_3_3x3/Conv2D_weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/StatefulPartitionedCall/vggface_senet50/conv5_3_3x3/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/StatefulPartitionedCall/vggface_senet50/conv3_3_3x3/Conv2D_bn_offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/StatefulPartitionedCall/vggface_senet50/conv3_3_1x1_increase/Conv2D_weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "128"}, {"size": "512"}]}}}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/StatefulPartitionedCall/vggface_senet50/conv5_1_1x1_proj/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "1024"}, {"size": "2048"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/StatefulPartitionedCall/vggface_senet50/conv3_3_1x1_increase/Conv2D_bn_offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/StatefulPartitionedCall/vggface_senet50/conv5_1_1x1_proj/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "2048"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/StatefulPartitionedCall/vggface_senet50/conv3_4_1x1_reduce/Conv2D_weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "512"}, {"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/StatefulPartitionedCall/vggface_senet50/conv5_1_3x3/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "512"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/StatefulPartitionedCall/vggface_senet50/conv3_4_1x1_reduce/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/StatefulPartitionedCall/vggface_senet50/conv3_4_3x3/Conv2D_weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/StatefulPartitionedCall/vggface_senet50/conv5_1_3x3/Conv2D_bn_offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/StatefulPartitionedCall/vggface_senet50/conv3_4_3x3/Conv2D_bn_offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/StatefulPartitionedCall/vggface_senet50/conv5_3_1x1_increase/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "512"}, {"size": "2048"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/StatefulPartitionedCall/vggface_senet50/conv3_4_1x1_increase/Conv2D_weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "128"}, {"size": "512"}]}}}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/StatefulPartitionedCall/vggface_senet50/conv3_4_1x1_increase/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/StatefulPartitionedCall/vggface_senet50/conv5_1_1x1_increase/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "512"}, {"size": "2048"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/StatefulPartitionedCall/vggface_senet50/conv5_1_1x1_increase/Conv2D_bn_offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "2048"}]}}}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/StatefulPartitionedCall/vggface_senet50/conv4_1_1x1_reduce/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "512"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/StatefulPartitionedCall/vggface_senet50/conv4_1_1x1_reduce/Conv2D_bn_offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/StatefulPartitionedCall/vggface_senet50/conv4_1_1x1_proj/Conv2D_weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "512"}, {"size": "1024"}]}}}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/StatefulPartitionedCall/vggface_senet50/conv4_1_1x1_proj/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1024"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/StatefulPartitionedCall/vggface_senet50/conv4_1_3x3/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "256"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/StatefulPartitionedCall/vggface_senet50/conv4_1_3x3/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/StatefulPartitionedCall/vggface_senet50/conv4_1_1x1_increase/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "256"}, {"size": "1024"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/StatefulPartitionedCall/vggface_senet50/conv4_1_1x1_increase/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1024"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/StatefulPartitionedCall/vggface_senet50/conv5_3_1x1_increase/Conv2D_bn_offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "2048"}]}}}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/StatefulPartitionedCall/vggface_senet50/conv4_2_1x1_reduce/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "1024"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/StatefulPartitionedCall/vggface_senet50/conv4_2_1x1_reduce/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/StatefulPartitionedCall/vggface_senet50/conv4_2_3x3/Conv2D_weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "256"}, {"size": "256"}]}}}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/StatefulPartitionedCall/vggface_senet50/conv4_2_3x3/Conv2D_bn_offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/StatefulPartitionedCall/vggface_senet50/conv4_2_1x1_increase/Conv2D_weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "256"}, {"size": "1024"}]}}}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/StatefulPartitionedCall/vggface_senet50/conv4_2_1x1_increase/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1024"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/StatefulPartitionedCall/vggface_senet50/conv5_2_1x1_reduce/Conv2D_weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "2048"}, {"size": "512"}]}}}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/StatefulPartitionedCall/vggface_senet50/conv4_3_1x1_reduce/Conv2D_weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "1024"}, {"size": "256"}]}}}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/StatefulPartitionedCall/vggface_senet50/conv5_2_1x1_reduce/Conv2D_bn_offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/StatefulPartitionedCall/vggface_senet50/conv4_3_1x1_reduce/Conv2D_bn_offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/StatefulPartitionedCall/vggface_senet50/conv4_3_3x3/Conv2D_weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "256"}, {"size": "256"}]}}}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/StatefulPartitionedCall/vggface_senet50/conv4_3_3x3/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/StatefulPartitionedCall/vggface_senet50/conv5_2_3x3/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "512"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/StatefulPartitionedCall/vggface_senet50/conv4_3_1x1_increase/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "256"}, {"size": "1024"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/StatefulPartitionedCall/vggface_senet50/conv4_3_1x1_increase/Conv2D_bn_offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1024"}]}}}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/StatefulPartitionedCall/vggface_senet50/conv5_2_3x3/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/StatefulPartitionedCall/vggface_senet50/conv4_4_1x1_reduce/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "1024"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/StatefulPartitionedCall/vggface_senet50/conv5_2_1x1_increase/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "512"}, {"size": "2048"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/StatefulPartitionedCall/vggface_senet50/conv4_4_1x1_reduce/Conv2D_bn_offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/StatefulPartitionedCall/vggface_senet50/conv4_4_3x3/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "256"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/StatefulPartitionedCall/vggface_senet50/conv5_2_1x1_increase/Conv2D_bn_offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "2048"}]}}}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/StatefulPartitionedCall/vggface_senet50/conv4_4_3x3/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/StatefulPartitionedCall/vggface_senet50/conv4_4_1x1_increase/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "256"}, {"size": "1024"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/StatefulPartitionedCall/vggface_senet50/conv4_4_1x1_increase/Conv2D_bn_offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1024"}]}}}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/StatefulPartitionedCall/vggface_senet50/conv4_5_1x1_reduce/Conv2D_weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "1024"}, {"size": "256"}]}}}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/StatefulPartitionedCall/vggface_senet50/conv4_5_1x1_reduce/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/StatefulPartitionedCall/vggface_senet50/conv4_5_3x3/Conv2D_weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "256"}, {"size": "256"}]}}}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/StatefulPartitionedCall/vggface_senet50/conv4_5_3x3/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/StatefulPartitionedCall/vggface_senet50/conv4_5_1x1_increase/Conv2D_weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "256"}, {"size": "1024"}]}}}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/StatefulPartitionedCall/vggface_senet50/conv4_5_1x1_increase/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1024"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/strided_slice", "op": "StridedSlice", "input": ["input_tensor", "StatefulPartitionedCall/strided_slice/stack", "StatefulPartitionedCall/strided_slice/stack_1", "StatefulPartitionedCall/strided_slice/stack_2"], "attr": {"shrink_axis_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "T": {"type": "DT_FLOAT"}, "ellipsis_mask": {"i": "1"}, "end_mask": {"i": "2"}, "Index": {"type": "DT_INT32"}, "begin_mask": {"i": "2"}}}, {"name": "StatefulPartitionedCall/sub", "op": "Sub", "input": ["StatefulPartitionedCall/strided_slice", "StatefulPartitionedCall/Const"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/StatefulPartitionedCall/vggface_senet50/global_average_pooling2d_16/Mean/reduction_indices", "op": "Const", "input": ["^StatefulPartitionedCall/sub"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/StatefulPartitionedCall/vggface_senet50/reshape_16/strided_slice/stack", "op": "Const", "input": ["^StatefulPartitionedCall/sub"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/StatefulPartitionedCall/vggface_senet50/reshape_16/strided_slice/stack_1", "op": "Const", "input": ["^StatefulPartitionedCall/sub"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/StatefulPartitionedCall/vggface_senet50/reshape_16/strided_slice/stack_2", "op": "Const", "input": ["^StatefulPartitionedCall/sub"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/StatefulPartitionedCall/vggface_senet50/reshape_16/Reshape/shape/1", "op": "Const", "input": ["^StatefulPartitionedCall/sub"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/StatefulPartitionedCall/vggface_senet50/reshape_16/Reshape/shape/2", "op": "Const", "input": ["^StatefulPartitionedCall/sub"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/StatefulPartitionedCall/vggface_senet50/reshape_16/Reshape/shape/3", "op": "Const", "input": ["^StatefulPartitionedCall/sub"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/StatefulPartitionedCall/vggface_senet50/conv5_3_1x1_down/Conv2D/ReadVariableOp", "op": "Const", "input": ["^StatefulPartitionedCall/sub"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "2048"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/StatefulPartitionedCall/vggface_senet50/conv5_3_1x1_down/BiasAdd/ReadVariableOp", "op": "Const", "input": ["^StatefulPartitionedCall/sub"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/StatefulPartitionedCall/vggface_senet50/conv5_3_1x1_up/Conv2D/ReadVariableOp", "op": "Const", "input": ["^StatefulPartitionedCall/sub"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "128"}, {"size": "2048"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/StatefulPartitionedCall/vggface_senet50/conv5_3_1x1_up/BiasAdd/ReadVariableOp", "op": "Const", "input": ["^StatefulPartitionedCall/sub"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "2048"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/StatefulPartitionedCall/vggface_senet50/global_average_pooling2d_15/Mean/reduction_indices", "op": "Const", "input": ["^StatefulPartitionedCall/sub"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/StatefulPartitionedCall/vggface_senet50/reshape_15/strided_slice/stack", "op": "Const", "input": ["^StatefulPartitionedCall/sub"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/StatefulPartitionedCall/vggface_senet50/reshape_15/strided_slice/stack_1", "op": "Const", "input": ["^StatefulPartitionedCall/sub"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/StatefulPartitionedCall/vggface_senet50/reshape_15/strided_slice/stack_2", "op": "Const", "input": ["^StatefulPartitionedCall/sub"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/StatefulPartitionedCall/vggface_senet50/reshape_15/Reshape/shape/1", "op": "Const", "input": ["^StatefulPartitionedCall/sub"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/StatefulPartitionedCall/vggface_senet50/reshape_15/Reshape/shape/2", "op": "Const", "input": ["^StatefulPartitionedCall/sub"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/StatefulPartitionedCall/vggface_senet50/reshape_15/Reshape/shape/3", "op": "Const", "input": ["^StatefulPartitionedCall/sub"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/StatefulPartitionedCall/vggface_senet50/conv5_2_1x1_down/Conv2D/ReadVariableOp", "op": "Const", "input": ["^StatefulPartitionedCall/sub"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "2048"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/StatefulPartitionedCall/vggface_senet50/conv5_2_1x1_down/BiasAdd/ReadVariableOp", "op": "Const", "input": ["^StatefulPartitionedCall/sub"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/StatefulPartitionedCall/vggface_senet50/conv5_2_1x1_up/Conv2D/ReadVariableOp", "op": "Const", "input": ["^StatefulPartitionedCall/sub"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "128"}, {"size": "2048"}]}}}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/StatefulPartitionedCall/vggface_senet50/conv5_2_1x1_up/BiasAdd/ReadVariableOp", "op": "Const", "input": ["^StatefulPartitionedCall/sub"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "2048"}]}}}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/StatefulPartitionedCall/vggface_senet50/global_average_pooling2d_14/Mean/reduction_indices", "op": "Const", "input": ["^StatefulPartitionedCall/sub"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/StatefulPartitionedCall/vggface_senet50/reshape_14/strided_slice/stack", "op": "Const", "input": ["^StatefulPartitionedCall/sub"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/StatefulPartitionedCall/vggface_senet50/reshape_14/strided_slice/stack_1", "op": "Const", "input": ["^StatefulPartitionedCall/sub"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/StatefulPartitionedCall/vggface_senet50/reshape_14/strided_slice/stack_2", "op": "Const", "input": ["^StatefulPartitionedCall/sub"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/StatefulPartitionedCall/vggface_senet50/reshape_14/Reshape/shape/1", "op": "Const", "input": ["^StatefulPartitionedCall/sub"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/StatefulPartitionedCall/vggface_senet50/reshape_14/Reshape/shape/2", "op": "Const", "input": ["^StatefulPartitionedCall/sub"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/StatefulPartitionedCall/vggface_senet50/reshape_14/Reshape/shape/3", "op": "Const", "input": ["^StatefulPartitionedCall/sub"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/StatefulPartitionedCall/vggface_senet50/conv5_1_1x1_down/Conv2D/ReadVariableOp", "op": "Const", "input": ["^StatefulPartitionedCall/sub"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "2048"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/StatefulPartitionedCall/vggface_senet50/conv5_1_1x1_down/BiasAdd/ReadVariableOp", "op": "Const", "input": ["^StatefulPartitionedCall/sub"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/StatefulPartitionedCall/vggface_senet50/conv5_1_1x1_up/Conv2D/ReadVariableOp", "op": "Const", "input": ["^StatefulPartitionedCall/sub"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "128"}, {"size": "2048"}]}}}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/StatefulPartitionedCall/vggface_senet50/conv5_1_1x1_up/BiasAdd/ReadVariableOp", "op": "Const", "input": ["^StatefulPartitionedCall/sub"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "2048"}]}}}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/StatefulPartitionedCall/vggface_senet50/global_average_pooling2d_13/Mean/reduction_indices", "op": "Const", "input": ["^StatefulPartitionedCall/sub"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/StatefulPartitionedCall/vggface_senet50/reshape_13/strided_slice/stack", "op": "Const", "input": ["^StatefulPartitionedCall/sub"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/StatefulPartitionedCall/vggface_senet50/reshape_13/strided_slice/stack_1", "op": "Const", "input": ["^StatefulPartitionedCall/sub"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/StatefulPartitionedCall/vggface_senet50/reshape_13/strided_slice/stack_2", "op": "Const", "input": ["^StatefulPartitionedCall/sub"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/StatefulPartitionedCall/vggface_senet50/reshape_13/Reshape/shape/1", "op": "Const", "input": ["^StatefulPartitionedCall/sub"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/StatefulPartitionedCall/vggface_senet50/reshape_13/Reshape/shape/2", "op": "Const", "input": ["^StatefulPartitionedCall/sub"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/StatefulPartitionedCall/vggface_senet50/reshape_13/Reshape/shape/3", "op": "Const", "input": ["^StatefulPartitionedCall/sub"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/StatefulPartitionedCall/vggface_senet50/conv4_6_1x1_down/Conv2D/ReadVariableOp", "op": "Const", "input": ["^StatefulPartitionedCall/sub"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "1024"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/StatefulPartitionedCall/vggface_senet50/conv4_6_1x1_down/BiasAdd/ReadVariableOp", "op": "Const", "input": ["^StatefulPartitionedCall/sub"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/StatefulPartitionedCall/vggface_senet50/conv4_6_1x1_up/Conv2D/ReadVariableOp", "op": "Const", "input": ["^StatefulPartitionedCall/sub"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "64"}, {"size": "1024"}]}}}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/StatefulPartitionedCall/vggface_senet50/conv4_6_1x1_up/BiasAdd/ReadVariableOp", "op": "Const", "input": ["^StatefulPartitionedCall/sub"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1024"}]}}}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/StatefulPartitionedCall/vggface_senet50/global_average_pooling2d_12/Mean/reduction_indices", "op": "Const", "input": ["^StatefulPartitionedCall/sub"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/StatefulPartitionedCall/vggface_senet50/reshape_12/strided_slice/stack", "op": "Const", "input": ["^StatefulPartitionedCall/sub"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/StatefulPartitionedCall/vggface_senet50/reshape_12/strided_slice/stack_1", "op": "Const", "input": ["^StatefulPartitionedCall/sub"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/StatefulPartitionedCall/vggface_senet50/reshape_12/strided_slice/stack_2", "op": "Const", "input": ["^StatefulPartitionedCall/sub"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/StatefulPartitionedCall/vggface_senet50/reshape_12/Reshape/shape/1", "op": "Const", "input": ["^StatefulPartitionedCall/sub"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/StatefulPartitionedCall/vggface_senet50/reshape_12/Reshape/shape/2", "op": "Const", "input": ["^StatefulPartitionedCall/sub"], "attr": {"dtype": {"type": "DT_INT32"}, "value": 