{"format": "layers-model", "generatedBy": null, "convertedBy": "TensorFlow.js Converter v3.14.0", "modelTopology": null, "weightsManifest": [{"paths": ["group1-shard1of42.bin", "group1-shard2of42.bin", "group1-shard3of42.bin", "group1-shard4of42.bin", "group1-shard5of42.bin", "group1-shard6of42.bin", "group1-shard7of42.bin", "group1-shard8of42.bin", "group1-shard9of42.bin", "group1-shard10of42.bin", "group1-shard11of42.bin", "group1-shard12of42.bin", "group1-shard13of42.bin", "group1-shard14of42.bin", "group1-shard15of42.bin", "group1-shard16of42.bin", "group1-shard17of42.bin", "group1-shard18of42.bin", "group1-shard19of42.bin", "group1-shard20of42.bin", "group1-shard21of42.bin", "group1-shard22of42.bin", "group1-shard23of42.bin", "group1-shard24of42.bin", "group1-shard25of42.bin", "group1-shard26of42.bin", "group1-shard27of42.bin", "group1-shard28of42.bin", "group1-shard29of42.bin", "group1-shard30of42.bin", "group1-shard31of42.bin", "group1-shard32of42.bin", "group1-shard33of42.bin", "group1-shard34of42.bin", "group1-shard35of42.bin", "group1-shard36of42.bin", "group1-shard37of42.bin", "group1-shard38of42.bin", "group1-shard39of42.bin", "group1-shard40of42.bin", "group1-shard41of42.bin", "group1-shard42of42.bin"], "weights": [{"name": "conv1/7x7_s2/kernel", "shape": [7, 7, 3, 64], "dtype": "float32"}, {"name": "conv1/7x7_s2/bn/gamma", "shape": [64], "dtype": "float32"}, {"name": "conv1/7x7_s2/bn/beta", "shape": [64], "dtype": "float32"}, {"name": "conv1/7x7_s2/bn/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "conv1/7x7_s2/bn/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "conv2_1_1x1_reduce/kernel", "shape": [1, 1, 64, 64], "dtype": "float32"}, {"name": "conv2_1_1x1_reduce/bn/gamma", "shape": [64], "dtype": "float32"}, {"name": "conv2_1_1x1_reduce/bn/beta", "shape": [64], "dtype": "float32"}, {"name": "conv2_1_1x1_reduce/bn/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "conv2_1_1x1_reduce/bn/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "conv2_1_3x3/kernel", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "conv2_1_3x3/bn/gamma", "shape": [64], "dtype": "float32"}, {"name": "conv2_1_3x3/bn/beta", "shape": [64], "dtype": "float32"}, {"name": "conv2_1_3x3/bn/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "conv2_1_3x3/bn/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "conv2_1_1x1_increase/kernel", "shape": [1, 1, 64, 256], "dtype": "float32"}, {"name": "conv2_1_1x1_increase/bn/gamma", "shape": [256], "dtype": "float32"}, {"name": "conv2_1_1x1_increase/bn/beta", "shape": [256], "dtype": "float32"}, {"name": "conv2_1_1x1_increase/bn/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "conv2_1_1x1_increase/bn/moving_variance", "shape": [256], "dtype": "float32"}, {"name": "conv2_1_1x1_down/kernel", "shape": [1, 1, 256, 16], "dtype": "float32"}, {"name": "conv2_1_1x1_down/bias", "shape": [16], "dtype": "float32"}, {"name": "conv2_1_1x1_up/kernel", "shape": [1, 1, 16, 256], "dtype": "float32"}, {"name": "conv2_1_1x1_up/bias", "shape": [256], "dtype": "float32"}, {"name": "conv2_1_1x1_proj/kernel", "shape": [1, 1, 64, 256], "dtype": "float32"}, {"name": "conv2_1_1x1_proj/bn/gamma", "shape": [256], "dtype": "float32"}, {"name": "conv2_1_1x1_proj/bn/beta", "shape": [256], "dtype": "float32"}, {"name": "conv2_1_1x1_proj/bn/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "conv2_1_1x1_proj/bn/moving_variance", "shape": [256], "dtype": "float32"}, {"name": "conv2_2_1x1_reduce/kernel", "shape": [1, 1, 256, 64], "dtype": "float32"}, {"name": "conv2_2_1x1_reduce/bn/gamma", "shape": [64], "dtype": "float32"}, {"name": "conv2_2_1x1_reduce/bn/beta", "shape": [64], "dtype": "float32"}, {"name": "conv2_2_1x1_reduce/bn/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "conv2_2_1x1_reduce/bn/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "conv2_2_3x3/kernel", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "conv2_2_3x3/bn/gamma", "shape": [64], "dtype": "float32"}, {"name": "conv2_2_3x3/bn/beta", "shape": [64], "dtype": "float32"}, {"name": "conv2_2_3x3/bn/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "conv2_2_3x3/bn/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "conv2_2_1x1_increase/kernel", "shape": [1, 1, 64, 256], "dtype": "float32"}, {"name": "conv2_2_1x1_increase/bn/gamma", "shape": [256], "dtype": "float32"}, {"name": "conv2_2_1x1_increase/bn/beta", "shape": [256], "dtype": "float32"}, {"name": "conv2_2_1x1_increase/bn/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "conv2_2_1x1_increase/bn/moving_variance", "shape": [256], "dtype": "float32"}, {"name": "conv2_2_1x1_down/kernel", "shape": [1, 1, 256, 16], "dtype": "float32"}, {"name": "conv2_2_1x1_down/bias", "shape": [16], "dtype": "float32"}, {"name": "conv2_2_1x1_up/kernel", "shape": [1, 1, 16, 256], "dtype": "float32"}, {"name": "conv2_2_1x1_up/bias", "shape": [256], "dtype": "float32"}, {"name": "conv2_3_1x1_reduce/kernel", "shape": [1, 1, 256, 64], "dtype": "float32"}, {"name": "conv2_3_1x1_reduce/bn/gamma", "shape": [64], "dtype": "float32"}, {"name": "conv2_3_1x1_reduce/bn/beta", "shape": [64], "dtype": "float32"}, {"name": "conv2_3_1x1_reduce/bn/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "conv2_3_1x1_reduce/bn/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "conv2_3_3x3/kernel", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "conv2_3_3x3/bn/gamma", "shape": [64], "dtype": "float32"}, {"name": "conv2_3_3x3/bn/beta", "shape": [64], "dtype": "float32"}, {"name": "conv2_3_3x3/bn/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "conv2_3_3x3/bn/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "conv2_3_1x1_increase/kernel", "shape": [1, 1, 64, 256], "dtype": "float32"}, {"name": "conv2_3_1x1_increase/bn/gamma", "shape": [256], "dtype": "float32"}, {"name": "conv2_3_1x1_increase/bn/beta", "shape": [256], "dtype": "float32"}, {"name": "conv2_3_1x1_increase/bn/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "conv2_3_1x1_increase/bn/moving_variance", "shape": [256], "dtype": "float32"}, {"name": "conv2_3_1x1_down/kernel", "shape": [1, 1, 256, 16], "dtype": "float32"}, {"name": "conv2_3_1x1_down/bias", "shape": [16], "dtype": "float32"}, {"name": "conv2_3_1x1_up/kernel", "shape": [1, 1, 16, 256], "dtype": "float32"}, {"name": "conv2_3_1x1_up/bias", "shape": [256], "dtype": "float32"}, {"name": "conv3_1_1x1_reduce/kernel", "shape": [1, 1, 256, 128], "dtype": "float32"}, {"name": "conv3_1_1x1_reduce/bn/gamma", "shape": [128], "dtype": "float32"}, {"name": "conv3_1_1x1_reduce/bn/beta", "shape": [128], "dtype": "float32"}, {"name": "conv3_1_1x1_reduce/bn/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "conv3_1_1x1_reduce/bn/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "conv3_1_3x3/kernel", "shape": [3, 3, 128, 128], "dtype": "float32"}, {"name": "conv3_1_3x3/bn/gamma", "shape": [128], "dtype": "float32"}, {"name": "conv3_1_3x3/bn/beta", "shape": [128], "dtype": "float32"}, {"name": "conv3_1_3x3/bn/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "conv3_1_3x3/bn/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "conv3_1_1x1_increase/kernel", "shape": [1, 1, 128, 512], "dtype": "float32"}, {"name": "conv3_1_1x1_increase/bn/gamma", "shape": [512], "dtype": "float32"}, {"name": "conv3_1_1x1_increase/bn/beta", "shape": [512], "dtype": "float32"}, {"name": "conv3_1_1x1_increase/bn/moving_mean", "shape": [512], "dtype": "float32"}, {"name": "conv3_1_1x1_increase/bn/moving_variance", "shape": [512], "dtype": "float32"}, {"name": "conv3_1_1x1_down/kernel", "shape": [1, 1, 512, 32], "dtype": "float32"}, {"name": "conv3_1_1x1_down/bias", "shape": [32], "dtype": "float32"}, {"name": "conv3_1_1x1_up/kernel", "shape": [1, 1, 32, 512], "dtype": "float32"}, {"name": "conv3_1_1x1_up/bias", "shape": [512], "dtype": "float32"}, {"name": "conv3_1_1x1_proj/kernel", "shape": [1, 1, 256, 512], "dtype": "float32"}, {"name": "conv3_1_1x1_proj/bn/gamma", "shape": [512], "dtype": "float32"}, {"name": "conv3_1_1x1_proj/bn/beta", "shape": [512], "dtype": "float32"}, {"name": "conv3_1_1x1_proj/bn/moving_mean", "shape": [512], "dtype": "float32"}, {"name": "conv3_1_1x1_proj/bn/moving_variance", "shape": [512], "dtype": "float32"}, {"name": "conv3_2_1x1_reduce/kernel", "shape": [1, 1, 512, 128], "dtype": "float32"}, {"name": "conv3_2_1x1_reduce/bn/gamma", "shape": [128], "dtype": "float32"}, {"name": "conv3_2_1x1_reduce/bn/beta", "shape": [128], "dtype": "float32"}, {"name": "conv3_2_1x1_reduce/bn/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "conv3_2_1x1_reduce/bn/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "conv3_2_3x3/kernel", "shape": [3, 3, 128, 128], "dtype": "float32"}, {"name": "conv3_2_3x3/bn/gamma", "shape": [128], "dtype": "float32"}, {"name": "conv3_2_3x3/bn/beta", "shape": [128], "dtype": "float32"}, {"name": "conv3_2_3x3/bn/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "conv3_2_3x3/bn/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "conv3_2_1x1_increase/kernel", "shape": [1, 1, 128, 512], "dtype": "float32"}, {"name": "conv3_2_1x1_increase/bn/gamma", "shape": [512], "dtype": "float32"}, {"name": "conv3_2_1x1_increase/bn/beta", "shape": [512], "dtype": "float32"}, {"name": "conv3_2_1x1_increase/bn/moving_mean", "shape": [512], "dtype": "float32"}, {"name": "conv3_2_1x1_increase/bn/moving_variance", "shape": [512], "dtype": "float32"}, {"name": "conv3_2_1x1_down/kernel", "shape": [1, 1, 512, 32], "dtype": "float32"}, {"name": "conv3_2_1x1_down/bias", "shape": [32], "dtype": "float32"}, {"name": "conv3_2_1x1_up/kernel", "shape": [1, 1, 32, 512], "dtype": "float32"}, {"name": "conv3_2_1x1_up/bias", "shape": [512], "dtype": "float32"}, {"name": "conv3_3_1x1_reduce/kernel", "shape": [1, 1, 512, 128], "dtype": "float32"}, {"name": "conv3_3_1x1_reduce/bn/gamma", "shape": [128], "dtype": "float32"}, {"name": "conv3_3_1x1_reduce/bn/beta", "shape": [128], "dtype": "float32"}, {"name": "conv3_3_1x1_reduce/bn/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "conv3_3_1x1_reduce/bn/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "conv3_3_3x3/kernel", "shape": [3, 3, 128, 128], "dtype": "float32"}, {"name": "conv3_3_3x3/bn/gamma", "shape": [128], "dtype": "float32"}, {"name": "conv3_3_3x3/bn/beta", "shape": [128], "dtype": "float32"}, {"name": "conv3_3_3x3/bn/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "conv3_3_3x3/bn/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "conv3_3_1x1_increase/kernel", "shape": [1, 1, 128, 512], "dtype": "float32"}, {"name": "conv3_3_1x1_increase/bn/gamma", "shape": [512], "dtype": "float32"}, {"name": "conv3_3_1x1_increase/bn/beta", "shape": [512], "dtype": "float32"}, {"name": "conv3_3_1x1_increase/bn/moving_mean", "shape": [512], "dtype": "float32"}, {"name": "conv3_3_1x1_increase/bn/moving_variance", "shape": [512], "dtype": "float32"}, {"name": "conv3_3_1x1_down/kernel", "shape": [1, 1, 512, 32], "dtype": "float32"}, {"name": "conv3_3_1x1_down/bias", "shape": [32], "dtype": "float32"}, {"name": "conv3_3_1x1_up/kernel", "shape": [1, 1, 32, 512], "dtype": "float32"}, {"name": "conv3_3_1x1_up/bias", "shape": [512], "dtype": "float32"}, {"name": "conv3_4_1x1_reduce/kernel", "shape": [1, 1, 512, 128], "dtype": "float32"}, {"name": "conv3_4_1x1_reduce/bn/gamma", "shape": [128], "dtype": "float32"}, {"name": "conv3_4_1x1_reduce/bn/beta", "shape": [128], "dtype": "float32"}, {"name": "conv3_4_1x1_reduce/bn/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "conv3_4_1x1_reduce/bn/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "conv3_4_3x3/kernel", "shape": [3, 3, 128, 128], "dtype": "float32"}, {"name": "conv3_4_3x3/bn/gamma", "shape": [128], "dtype": "float32"}, {"name": "conv3_4_3x3/bn/beta", "shape": [128], "dtype": "float32"}, {"name": "conv3_4_3x3/bn/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "conv3_4_3x3/bn/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "conv3_4_1x1_increase/kernel", "shape": [1, 1, 128, 512], "dtype": "float32"}, {"name": "conv3_4_1x1_increase/bn/gamma", "shape": [512], "dtype": "float32"}, {"name": "conv3_4_1x1_increase/bn/beta", "shape": [512], "dtype": "float32"}, {"name": "conv3_4_1x1_increase/bn/moving_mean", "shape": [512], "dtype": "float32"}, {"name": "conv3_4_1x1_increase/bn/moving_variance", "shape": [512], "dtype": "float32"}, {"name": "conv3_4_1x1_down/kernel", "shape": [1, 1, 512, 32], "dtype": "float32"}, {"name": "conv3_4_1x1_down/bias", "shape": [32], "dtype": "float32"}, {"name": "conv3_4_1x1_up/kernel", "shape": [1, 1, 32, 512], "dtype": "float32"}, {"name": "conv3_4_1x1_up/bias", "shape": [512], "dtype": "float32"}, {"name": "conv4_1_1x1_reduce/kernel", "shape": [1, 1, 512, 256], "dtype": "float32"}, {"name": "conv4_1_1x1_reduce/bn/gamma", "shape": [256], "dtype": "float32"}, {"name": "conv4_1_1x1_reduce/bn/beta", "shape": [256], "dtype": "float32"}, {"name": "conv4_1_1x1_reduce/bn/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "conv4_1_1x1_reduce/bn/moving_variance", "shape": [256], "dtype": "float32"}, {"name": "conv4_1_3x3/kernel", "shape": [3, 3, 256, 256], "dtype": "float32"}, {"name": "conv4_1_3x3/bn/gamma", "shape": [256], "dtype": "float32"}, {"name": "conv4_1_3x3/bn/beta", "shape": [256], "dtype": "float32"}, {"name": "conv4_1_3x3/bn/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "conv4_1_3x3/bn/moving_variance", "shape": [256], "dtype": "float32"}, {"name": "conv4_1_1x1_increase/kernel", "shape": [1, 1, 256, 1024], "dtype": "float32"}, {"name": "conv4_1_1x1_increase/bn/gamma", "shape": [1024], "dtype": "float32"}, {"name": "conv4_1_1x1_increase/bn/beta", "shape": [1024], "dtype": "float32"}, {"name": "conv4_1_1x1_increase/bn/moving_mean", "shape": [1024], "dtype": "float32"}, {"name": "conv4_1_1x1_increase/bn/moving_variance", "shape": [1024], "dtype": "float32"}, {"name": "conv4_1_1x1_down/kernel", "shape": [1, 1, 1024, 64], "dtype": "float32"}, {"name": "conv4_1_1x1_down/bias", "shape": [64], "dtype": "float32"}, {"name": "conv4_1_1x1_up/kernel", "shape": [1, 1, 64, 1024], "dtype": "float32"}, {"name": "conv4_1_1x1_up/bias", "shape": [1024], "dtype": "float32"}, {"name": "conv4_1_1x1_proj/kernel", "shape": [1, 1, 512, 1024], "dtype": "float32"}, {"name": "conv4_1_1x1_proj/bn/gamma", "shape": [1024], "dtype": "float32"}, {"name": "conv4_1_1x1_proj/bn/beta", "shape": [1024], "dtype": "float32"}, {"name": "conv4_1_1x1_proj/bn/moving_mean", "shape": [1024], "dtype": "float32"}, {"name": "conv4_1_1x1_proj/bn/moving_variance", "shape": [1024], "dtype": "float32"}, {"name": "conv4_2_1x1_reduce/kernel", "shape": [1, 1, 1024, 256], "dtype": "float32"}, {"name": "conv4_2_1x1_reduce/bn/gamma", "shape": [256], "dtype": "float32"}, {"name": "conv4_2_1x1_reduce/bn/beta", "shape": [256], "dtype": "float32"}, {"name": "conv4_2_1x1_reduce/bn/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "conv4_2_1x1_reduce/bn/moving_variance", "shape": [256], "dtype": "float32"}, {"name": "conv4_2_3x3/kernel", "shape": [3, 3, 256, 256], "dtype": "float32"}, {"name": "conv4_2_3x3/bn/gamma", "shape": [256], "dtype": "float32"}, {"name": "conv4_2_3x3/bn/beta", "shape": [256], "dtype": "float32"}, {"name": "conv4_2_3x3/bn/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "conv4_2_3x3/bn/moving_variance", "shape": [256], "dtype": "float32"}, {"name": "conv4_2_1x1_increase/kernel", "shape": [1, 1, 256, 1024], "dtype": "float32"}, {"name": "conv4_2_1x1_increase/bn/gamma", "shape": [1024], "dtype": "float32"}, {"name": "conv4_2_1x1_increase/bn/beta", "shape": [1024], "dtype": "float32"}, {"name": "conv4_2_1x1_increase/bn/moving_mean", "shape": [1024], "dtype": "float32"}, {"name": "conv4_2_1x1_increase/bn/moving_variance", "shape": [1024], "dtype": "float32"}, {"name": "conv4_2_1x1_down/kernel", "shape": [1, 1, 1024, 64], "dtype": "float32"}, {"name": "conv4_2_1x1_down/bias", "shape": [64], "dtype": "float32"}, {"name": "conv4_2_1x1_up/kernel", "shape": [1, 1, 64, 1024], "dtype": "float32"}, {"name": "conv4_2_1x1_up/bias", "shape": [1024], "dtype": "float32"}, {"name": "conv4_3_1x1_reduce/kernel", "shape": [1, 1, 1024, 256], "dtype": "float32"}, {"name": "conv4_3_1x1_reduce/bn/gamma", "shape": [256], "dtype": "float32"}, {"name": "conv4_3_1x1_reduce/bn/beta", "shape": [256], "dtype": "float32"}, {"name": "conv4_3_1x1_reduce/bn/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "conv4_3_1x1_reduce/bn/moving_variance", "shape": [256], "dtype": "float32"}, {"name": "conv4_3_3x3/kernel", "shape": [3, 3, 256, 256], "dtype": "float32"}, {"name": "conv4_3_3x3/bn/gamma", "shape": [256], "dtype": "float32"}, {"name": "conv4_3_3x3/bn/beta", "shape": [256], "dtype": "float32"}, {"name": "conv4_3_3x3/bn/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "conv4_3_3x3/bn/moving_variance", "shape": [256], "dtype": "float32"}, {"name": "conv4_3_1x1_increase/kernel", "shape": [1, 1, 256, 1024], "dtype": "float32"}, {"name": "conv4_3_1x1_increase/bn/gamma", "shape": [1024], "dtype": "float32"}, {"name": "conv4_3_1x1_increase/bn/beta", "shape": [1024], "dtype": "float32"}, {"name": "conv4_3_1x1_increase/bn/moving_mean", "shape": [1024], "dtype": "float32"}, {"name": "conv4_3_1x1_increase/bn/moving_variance", "shape": [1024], "dtype": "float32"}, {"name": "conv4_3_1x1_down/kernel", "shape": [1, 1, 1024, 64], "dtype": "float32"}, {"name": "conv4_3_1x1_down/bias", "shape": [64], "dtype": "float32"}, {"name": "conv4_3_1x1_up/kernel", "shape": [1, 1, 64, 1024], "dtype": "float32"}, {"name": "conv4_3_1x1_up/bias", "shape": [1024], "dtype": "float32"}, {"name": "conv4_4_1x1_reduce/kernel", "shape": [1, 1, 1024, 256], "dtype": "float32"}, {"name": "conv4_4_1x1_reduce/bn/gamma", "shape": [256], "dtype": "float32"}, {"name": "conv4_4_1x1_reduce/bn/beta", "shape": [256], "dtype": "float32"}, {"name": "conv4_4_1x1_reduce/bn/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "conv4_4_1x1_reduce/bn/moving_variance", "shape": [256], "dtype": "float32"}, {"name": "conv4_4_3x3/kernel", "shape": [3, 3, 256, 256], "dtype": "float32"}, {"name": "conv4_4_3x3/bn/gamma", "shape": [256], "dtype": "float32"}, {"name": "conv4_4_3x3/bn/beta", "shape": [256], "dtype": "float32"}, {"name": "conv4_4_3x3/bn/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "conv4_4_3x3/bn/moving_variance", "shape": [256], "dtype": "float32"}, {"name": "conv4_4_1x1_increase/kernel", "shape": [1, 1, 256, 1024], "dtype": "float32"}, {"name": "conv4_4_1x1_increase/bn/gamma", "shape": [1024], "dtype": "float32"}, {"name": "conv4_4_1x1_increase/bn/beta", "shape": [1024], "dtype": "float32"}, {"name": "conv4_4_1x1_increase/bn/moving_mean", "shape": [1024], "dtype": "float32"}, {"name": "conv4_4_1x1_increase/bn/moving_variance", "shape": [1024], "dtype": "float32"}, {"name": "conv4_4_1x1_down/kernel", "shape": [1, 1, 1024, 64], "dtype": "float32"}, {"name": "conv4_4_1x1_down/bias", "shape": [64], "dtype": "float32"}, {"name": "conv4_4_1x1_up/kernel", "shape": [1, 1, 64, 1024], "dtype": "float32"}, {"name": "conv4_4_1x1_up/bias", "shape": [1024], "dtype": "float32"}, {"name": "conv4_5_1x1_reduce/kernel", "shape": [1, 1, 1024, 256], "dtype": "float32"}, {"name": "conv4_5_1x1_reduce/bn/gamma", "shape": [256], "dtype": "float32"}, {"name": "conv4_5_1x1_reduce/bn/beta", "shape": [256], "dtype": "float32"}, {"name": "conv4_5_1x1_reduce/bn/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "conv4_5_1x1_reduce/bn/moving_variance", "shape": [256], "dtype": "float32"}, {"name": "conv4_5_3x3/kernel", "shape": [3, 3, 256, 256], "dtype": "float32"}, {"name": "conv4_5_3x3/bn/gamma", "shape": [256], "dtype": "float32"}, {"name": "conv4_5_3x3/bn/beta", "shape": [256], "dtype": "float32"}, {"name": "conv4_5_3x3/bn/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "conv4_5_3x3/bn/moving_variance", "shape": [256], "dtype": "float32"}, {"name": "conv4_5_1x1_increase/kernel", "shape": [1, 1, 256, 1024], "dtype": "float32"}, {"name": "conv4_5_1x1_increase/bn/gamma", "shape": [1024], "dtype": "float32"}, {"name": "conv4_5_1x1_increase/bn/beta", "shape": [1024], "dtype": "float32"}, {"name": "conv4_5_1x1_increase/bn/moving_mean", "shape": [1024], "dtype": "float32"}, {"name": "conv4_5_1x1_increase/bn/moving_variance", "shape": [1024], "dtype": "float32"}, {"name": "conv4_5_1x1_down/kernel", "shape": [1, 1, 1024, 64], "dtype": "float32"}, {"name": "conv4_5_1x1_down/bias", "shape": [64], "dtype": "float32"}, {"name": "conv4_5_1x1_up/kernel", "shape": [1, 1, 64, 1024], "dtype": "float32"}, {"name": "conv4_5_1x1_up/bias", "shape": [1024], "dtype": "float32"}, {"name": "conv4_6_1x1_reduce/kernel", "shape": [1, 1, 1024, 256], "dtype": "float32"}, {"name": "conv4_6_1x1_reduce/bn/gamma", "shape": [256], "dtype": "float32"}, {"name": "conv4_6_1x1_reduce/bn/beta", "shape": [256], "dtype": "float32"}, {"name": "conv4_6_1x1_reduce/bn/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "conv4_6_1x1_reduce/bn/moving_variance", "shape": [256], "dtype": "float32"}, {"name": "conv4_6_3x3/kernel", "shape": [3, 3, 256, 256], "dtype": "float32"}, {"name": "conv4_6_3x3/bn/gamma", "shape": [256], "dtype": "float32"}, {"name": "conv4_6_3x3/bn/beta", "shape": [256], "dtype": "float32"}, {"name": "conv4_6_3x3/bn/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "conv4_6_3x3/bn/moving_variance", "shape": [256], "dtype": "float32"}, {"name": "conv4_6_1x1_increase/kernel", "shape": [1, 1, 256, 1024], "dtype": "float32"}, {"name": "conv4_6_1x1_increase/bn/gamma", "shape": [1024], "dtype": "float32"}, {"name": "conv4_6_1x1_increase/bn/beta", "shape": [1024], "dtype": "float32"}, {"name": "conv4_6_1x1_increase/bn/moving_mean", "shape": [1024], "dtype": "float32"}, {"name": "conv4_6_1x1_increase/bn/moving_variance", "shape": [1024], "dtype": "float32"}, {"name": "conv4_6_1x1_down/kernel", "shape": [1, 1, 1024, 64], "dtype": "float32"}, {"name": "conv4_6_1x1_down/bias", "shape": [64], "dtype": "float32"}, {"name": "conv4_6_1x1_up/kernel", "shape": [1, 1, 64, 1024], "dtype": "float32"}, {"name": "conv4_6_1x1_up/bias", "shape": [1024], "dtype": "float32"}, {"name": "conv5_1_1x1_reduce/kernel", "shape": [1, 1, 1024, 512], "dtype": "float32"}, {"name": "conv5_1_1x1_reduce/bn/gamma", "shape": [512], "dtype": "float32"}, {"name": "conv5_1_1x1_reduce/bn/beta", "shape": [512], "dtype": "float32"}, {"name": "conv5_1_1x1_reduce/bn/moving_mean", "shape": [512], "dtype": "float32"}, {"name": "conv5_1_1x1_reduce/bn/moving_variance", "shape": [512], "dtype": "float32"}, {"name": "conv5_1_3x3/kernel", "shape": [3, 3, 512, 512], "dtype": "float32"}, {"name": "conv5_1_3x3/bn/gamma", "shape": [512], "dtype": "float32"}, {"name": "conv5_1_3x3/bn/beta", "shape": [512], "dtype": "float32"}, {"name": "conv5_1_3x3/bn/moving_mean", "shape": [512], "dtype": "float32"}, {"name": "conv5_1_3x3/bn/moving_variance", "shape": [512], "dtype": "float32"}, {"name": "conv5_1_1x1_increase/kernel", "shape": [1, 1, 512, 2048], "dtype": "float32"}, {"name": "conv5_1_1x1_increase/bn/gamma", "shape": [2048], "dtype": "float32"}, {"name": "conv5_1_1x1_increase/bn/beta", "shape": [2048], "dtype": "float32"}, {"name": "conv5_1_1x1_increase/bn/moving_mean", "shape": [2048], "dtype": "float32"}, {"name": "conv5_1_1x1_increase/bn/moving_variance", "shape": [2048], "dtype": "float32"}, {"name": "conv5_1_1x1_down/kernel", "shape": [1, 1, 2048, 128], "dtype": "float32"}, {"name": "conv5_1_1x1_down/bias", "shape": [128], "dtype": "float32"}, {"name": "conv5_1_1x1_up/kernel", "shape": [1, 1, 128, 2048], "dtype": "float32"}, {"name": "conv5_1_1x1_up/bias", "shape": [2048], "dtype": "float32"}, {"name": "conv5_1_1x1_proj/kernel", "shape": [1, 1, 1024, 2048], "dtype": "float32"}, {"name": "conv5_1_1x1_proj/bn/gamma", "shape": [2048], "dtype": "float32"}, {"name": "conv5_1_1x1_proj/bn/beta", "shape": [2048], "dtype": "float32"}, {"name": "conv5_1_1x1_proj/bn/moving_mean", "shape": [2048], "dtype": "float32"}, {"name": "conv5_1_1x1_proj/bn/moving_variance", "shape": [2048], "dtype": "float32"}, {"name": "conv5_2_1x1_reduce/kernel", "shape": [1, 1, 2048, 512], "dtype": "float32"}, {"name": "conv5_2_1x1_reduce/bn/gamma", "shape": [512], "dtype": "float32"}, {"name": "conv5_2_1x1_reduce/bn/beta", "shape": [512], "dtype": "float32"}, {"name": "conv5_2_1x1_reduce/bn/moving_mean", "shape": [512], "dtype": "float32"}, {"name": "conv5_2_1x1_reduce/bn/moving_variance", "shape": [512], "dtype": "float32"}, {"name": "conv5_2_3x3/kernel", "shape": [3, 3, 512, 512], "dtype": "float32"}, {"name": "conv5_2_3x3/bn/gamma", "shape": [512], "dtype": "float32"}, {"name": "conv5_2_3x3/bn/beta", "shape": [512], "dtype": "float32"}, {"name": "conv5_2_3x3/bn/moving_mean", "shape": [512], "dtype": "float32"}, {"name": "conv5_2_3x3/bn/moving_variance", "shape": [512], "dtype": "float32"}, {"name": "conv5_2_1x1_increase/kernel", "shape": [1, 1, 512, 2048], "dtype": "float32"}, {"name": "conv5_2_1x1_increase/bn/gamma", "shape": [2048], "dtype": "float32"}, {"name": "conv5_2_1x1_increase/bn/beta", "shape": [2048], "dtype": "float32"}, {"name": "conv5_2_1x1_increase/bn/moving_mean", "shape": [2048], "dtype": "float32"}, {"name": "conv5_2_1x1_increase/bn/moving_variance", "shape": [2048], "dtype": "float32"}, {"name": "conv5_2_1x1_down/kernel", "shape": [1, 1, 2048, 128], "dtype": "float32"}, {"name": "conv5_2_1x1_down/bias", "shape": [128], "dtype": "float32"}, {"name": "conv5_2_1x1_up/kernel", "shape": [1, 1, 128, 2048], "dtype": "float32"}, {"name": "conv5_2_1x1_up/bias", "shape": [2048], "dtype": "float32"}, {"name": "conv5_3_1x1_reduce/kernel", "shape": [1, 1, 2048, 512], "dtype": "float32"}, {"name": "conv5_3_1x1_reduce/bn/gamma", "shape": [512], "dtype": "float32"}, {"name": "conv5_3_1x1_reduce/bn/beta", "shape": [512], "dtype": "float32"}, {"name": "conv5_3_1x1_reduce/bn/moving_mean", "shape": [512], "dtype": "float32"}, {"name": "conv5_3_1x1_reduce/bn/moving_variance", "shape": [512], "dtype": "float32"}, {"name": "conv5_3_3x3/kernel", "shape": [3, 3, 512, 512], "dtype": "float32"}, {"name": "conv5_3_3x3/bn/gamma", "shape": [512], "dtype": "float32"}, {"name": "conv5_3_3x3/bn/beta", "shape": [512], "dtype": "float32"}, {"name": "conv5_3_3x3/bn/moving_mean", "shape": [512], "dtype": "float32"}, {"name": "conv5_3_3x3/bn/moving_variance", "shape": [512], "dtype": "float32"}, {"name": "conv5_3_1x1_increase/kernel", "shape": [1, 1, 512, 2048], "dtype": "float32"}, {"name": "conv5_3_1x1_increase/bn/gamma", "shape": [2048], "dtype": "float32"}, {"name": "conv5_3_1x1_increase/bn/beta", "shape": [2048], "dtype": "float32"}, {"name": "conv5_3_1x1_increase/bn/moving_mean", "shape": [2048], "dtype": "float32"}, {"name": "conv5_3_1x1_increase/bn/moving_variance", "shape": [2048], "dtype": "float32"}, {"name": "conv5_3_1x1_down/kernel", "shape": [1, 1, 2048, 128], "dtype": "float32"}, {"name": "conv5_3_1x1_down/bias", "shape": [128], "dtype": "float32"}, {"name": "conv5_3_1x1_up/kernel", "shape": [1, 1, 128, 2048], "dtype": "float32"}, {"name": "conv5_3_1x1_up/bias", "shape": [2048], "dtype": "float32"}, {"name": "classifier/kernel", "shape": [2048, 8631], "dtype": "float32"}, {"name": "classifier/bias", "shape": [8631], "dtype": "float32"}]}]}